import numpy as np
import matplotlib.pyplot as plt

n =[1000, 10000, 100000, 1000000, 10000000, 100000000]

t= [572, 6845, 72417, 813200, 8691802, 103293478]


plt.plot(n, t)
n = [1000, 10000, 40000, 100000]
t = [3468, 431897, 10390929, 81461177]

plt.plot(n, t)
plt.title('Сравнение асимптотики наполнения дерева упорядочеными элементами')
plt.yscale('log')
plt.xscale('log')
plt.show()

n =[1000, 10000, 100000, 1000000, 10000000]

t= [394, 5033, 65000, 547285, 5200000]


plt.plot(n, t)

t = [682, 7815, 76388, 502806, 4595186]

plt.plot(n, t)
plt.title('Сравнение асимптотики наполнения дерева случайными элементами')
plt.yscale('log')
plt.xscale('log')
plt.show()


